{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js v3.5.0",
    "convertedBy": "TensorFlow.js Converter v3.5.0",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                1
              ],
              "dtype": "string",
              "sparse": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "TextVectorization",
            "config": {
              "name": "text_vectorization",
              "trainable": false,
              "dtype": "string",
              "max_tokens": 10000,
              "output_mode": "int",
              "output_sequence_length": null,
              "standardize": "lower_and_strip_punctuation",
              "split": "whitespace",
              "ngrams": null,
              "output_split": null,
              "pad_to_max_tokens": false,
              "vocabulary_size": 0
            },
            "name": "text_vectorization",
            "inbound_nodes": [
              [
                [
                  "input_1"
                ]
              ]
            ]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "dtype": "float32",
              "input_dim": 10000,
              "output_dim": 16,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            },
            "name": "embedding",
            "inbound_nodes": [
              [
                [
                  "text_vectorization"
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "global_average_pooling1d",
            "inbound_nodes": [
              [
                [
                  "embedding"
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "global_average_pooling1d"
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dense"
                ]
              ]
            ]
          }
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "path/to/weights_manifest.json"
        ],
        "weights": [
          {
            "name": "embedding/embeddings:0",
            "shape": [
              10000,
              16
            ],
            "dtype": "float32"
          },
          {
            "name": "dense/kernel:0",
            "shape": [
              16,
              16
            ],
            "dtype": "float32"
          },
          {
            "name": "dense/bias:0",
            "shape": [
              16
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel:0",
            "shape": [
              16,
              3
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias:0",
            "shape": [
              3
            ],
            "dtype": "float32"
          }
        ]
      }
    ],
    "formatVersion": "3.5.0"
  }
  